[
  {
    "id": 1,
    "path": 0,
    "title": "O que é Computação Quântica",
    "content": "Computação quântica é uma tecnologia emergente, que tenta resolver problemas difíceis demais ou até impossíveis para os supercomputadores tradicionais, por meio de uma abordagem de computação baseada em uma unidade básica completamente diferente: os qubits – em vez dos bits.</br></br>Na prática, o comportamento desses qubits permite que computadores quânticos rodem vários cálculos ao mesmo tempo, com múltiplas fontes de dados, com uma escala enorme.</br></br>Os computadores quânticos são máquinas caras e complexas, desenvolvidas por poucas empresas. Há computadores quânticos experimentais em laboratórios de universidades, em empresas privadas e startups, e também computadores que fazem parcialmente o que um computador quântico completo faria.",
    "image": {
      "src": "/assets/quantum/quantum-computing.jpg",
      "alt": "Ilustração de processador com um símbolo de um átomo",
      "width": 670,
      "height": 697
    }
  },
  {
    "id": 2,
    "path": 1,
    "title": "Porquê precisamos de um Computador Quântico",
    "content": ""
  },
  {
    "id": 3,
    "path": 1,
    "title": "Porquê você (provavelmente) não precisará de um.",
    "content": ""
  },
  {
    "id": 4,
    "path": 1,
    "title": "Quântica não é magia",
    "content": "Quando pesquisamos sobre computação quântica é comum encontrarmos muitas afirmações e analogias que não condizem com a realidade, criando assim mitos sobre o funcionamento das máquinas quânticas.</br></br>Uma das ideias mais difundidas é que &ldquo;o computador quântico encontra a solução para um problema testando simultaneamente todas as opções possíveis&rdquo;.</br></br>Da maneira como essa frase é montada deixa a entender que a tecnologia completa qualquer problema em um passo de mágica.</br></br>De certa forma pode-se dizer que um algoritmo quântico cria uma sobreposição de muitas possibilidades, entrelaça-as com seus resultados",
    "image": {
      "src": "/assets/quantum/magic.png",
      "alt": "Ilustração de um mago mexendo em um caldeirão",
      "width": "3000",
      "height": "2526"
    }
  },
  {
    "id": 5,
    "path": 1,
    "translate": {
      "y": "up"
    },
    "title": "Entenda as limitações",
    "content": "",
    "image": {
      "src": "/assets/quantum/barriers.png",
      "alt": "Ilustração de um homem passando por dentro de uma parede quebrada",
      "width": "2000",
      "height": "2000"
    }
  },
  {
    "id": 6,
    "path": 1,
    "title": "Porque não encontro um nas prateleiras?",
    "content": "Computadores quânticos só funcionam em condições muito específicas, o que inviabiliza a escala por enquanto. Os qubits só assumem as características de entrelaçamento em temperaturas próximas ao zero absoluto (-273,15º C), exigindo sistemas sofisticados de refrigeração. Além disso, o núcleo precisa ser blindado contra campos magnéticos ou ondas eletromagnéticas, que podem interferir nos cálculos e prejudicar o funcionamento desses computadores.",
    "image": {
      "src": "/assets/quantum/shelf.png",
      "alt": "Ilustração de um homem com uma luneta procurando um produto em uma prateleira de mercado",
      "width": "2000",
      "height": "2000"
    }
  },

  {
    "id": 7,
    "path": 2,
    "title": "Um pouquinho de física quântica",
    "content": "",
    "image": {
      "src": "/assets/quantum/physics.png",
      "alt": "Ilustração de alunos em uma sala de aula com um quadro negro escrito Física.",
      "width": "4200",
      "height": "3301"
    }
  },
  {
    "id": 8,
    "path": 2,
    "title": "Bit X Qubit",
    "content": "Um bit é a base da informação computacional. Independente de suas representações físicas, ele sempre é lido como 0 ou 1. Uma analogia são as posições de um interruptor de luz (a posição desligada pode ser representada por 0, enquanto a posição ligada pode ser representada por 1).</br></br>Um qubit possui algumas similaridades com o bit clássico, mas é bem diferente no geral. Como o bit, um qubit pode ter dois possíveis valores - normalmente um 0 ou um 1. A diferença é que enquanto um bit deve ser 0 ou 1, um qubit pode ser 0, 1, ou uma superposição de ambos.</br></br>Os estados em que um qubit pode ser medido são conhecidos como estados básicos (ou vetores). Como é tradição com qualquer tipo de estado quântico, Dirac, ou notação bra-ket é usada para representá-los.</br></br>Isso significa que dois estados básicos computacionais são convencionalmente escritos como |0> e |1> (pronunciado: 'ket 0' and 'ket 1').</br></br>O órgão francês Commissariat à l'Énergie Atomique criou uma representação da superposição.",
    "image": {
      "src": "/assets/quantum/bitxqubit.jpg",
      "alt": "O bit clássico podendo ser 0 ou 1, ou um qubit pode ser 0, 1 ou uma superposição de ambos",
      "width": "682",
      "height": "654"
    }
  },
  {
    "id": 9,
    "path": 2,
    "title": "Alfabeto Quântico",
    "content": [
      "<h3>> Comunicação quântica</h3></br>A teoria da informação quântica se baseia na possibilidade de escrever mensagens em uma partícula quântica e lê-las de maneira confiável.</br></br>Se, no entanto, a partícula é relativística, o que significa que ela se move com velocidades próximas à velocidade da luz, é impossível decodificar a mensagem sem ambiguidade usando as técnicas usadas hoje, e a comunicação falha.</br></br>Pelo menos falhava até agora. Pesquisadores da Universidade de Viena e da Academia Austríaca de Ciências desenvolveram uma forma de decodificar de forma confiável mensagens quânticas transmitidas em velocidades extremamente altas.</br></br>Isso abre novas possibilidades de aplicações tecnológicas em informação quântica e comunicação quântica.",
      "<h3>> Comunicação a velocidade da luz</h3></br>Imagine a seguinte situação: Maria e João querem trocar uma mensagem usando uma propriedade de uma partícula quântica, digamos o spin de um elétron, que é uma forma intrínseca da rotação dessas partículas. João precisa da mensagem de Maria o mais rápido possível, de forma que Maria tem que enviar o elétron na velocidade máxima, muito próximo da velocidade da luz. Dado que Maria tem o elétron em seu laboratório, em um local específico, o princípio da incerteza de Heisenberg proíbe que a velocidade do elétron seja definida com precisão.</br></br>Quando o elétron viaja a uma velocidade extremamente alta, a interação entre a relatividade especial e a física quântica faz com que o spin e a velocidade do elétron se entrelacem. Devido a essa correlação, que é mais forte do que é classicamente possível, João não consegue ler o spin com o método padrão.</br></br>Será que é possível que Maria e João possam melhorar sua estratégia de comunicação?</br></br>Flaminia Giacomini e seus colegas obtiveram essa melhoria introduzindo uma alternativa ao alfabeto padrão usado por Maria e João. A técnica garante que a mensagem, escrita por Maria e lida por João, possa ser decodificada sem ambiguidade, mesmo quando a partícula se comporta tanto de acordo com a mecânica quântica, por causa do princípio da incerteza de Heisenberg, quanto da relatividade especial, devido à sua velocidade muito alta.",
      "<h3>> Novo alfabeto quântico</h3></br>O novo alfabeto consiste em uma nova definição do spin das partículas quânticas que se movem muito rapidamente. Assim, a técnica modifica tanto a maneira como Maria escreve a mensagem, quanto a maneira como João a lê. A chave para esta técnica é uma &ldquo;tradução&rdquo; do modo como a mensagem é escrita e lida, entre o alfabeto padrão, usado quando o elétron está em repouso, e o novo alfabeto, usado quando o elétron viaja muito rápido.</br></br>&ldquo;Estes resultados são indicativos de que esse procedimento de tradução pode desvelar novas aplicações em informações quânticas relativísticas,&rdquo; disse Flaminia.</br></br>Por exemplo, essa técnica pode ser útil na comunicação quântica via satélite, na qual uma partícula que carrega uma mensagem precisa viajar rapidamente entre dois pontos distantes."
    ]
  },
  {
    "id": 10,
    "path": 2,
    "translate": {
      "y": "up"
    },
    "title": "Transposição de bits",
    "content": ""
  },
  {
    "id": 11,
    "path": 2,
    "translate": {
      "x": "left",
      "y": "down"
    },
    "title": "Entrelaçamento Quântico",
    "content": [
      "Propriedade da mecânica quântica que precisamos alavancar para criar um computador quântico.</br></br>Sabe-se que, uma vez que dois sistemas quânticos interagem um com o outro, eles se tornam parceiros irremediavelmente entrelaçados. A partir de então, o estado de um sistema lhe dará informações precisas sobre o estado do outro sistema, não importando o quanto os dois estejam interligados entre si. Os dois sistemas podem estar separados por anos-luz e ainda fornecer informações precisas e instantâneas um sobre o outro. Vamos ilustrar isso com um exemplo concreto, já que isso causou até mesmo um reboliço na cabeça de Einstein (Einstein notoriamente se referiu a esse fenômeno como &ldquo;Ação assustadora à distância&rdquo;).</br></br>Suponha que você tenha dois elétrons, A e B. Depois de fazer com que eles interajam, seus spins opostos serão automaticamente entrelaçados. Daí em diante, se o giro de A for para cima, o giro de B será para baixo, como duas crianças em uma gangorra, exceto que isso vale até para você levar A e B para extremos opostos da Terra (ou da galáxia). Apesar dos milhares de quilômetros (ou anos-luz) entre eles, está provado que, se A girar para cima, saberá imediatamente que o giro de B é para baixo. Já aprendemos que esses sistemas não têm valores precisos/únicos, mas que existem em uma superposição obscura. Se assim for, temos ainda outro problema em nossas mãos, porque Einstein nos ensinou que nenhuma influência causal, como um sinal luminoso, entre dois sistemas pode viajar mais rápido que a velocidade da luz. Então, o que dá? Tudo dito, eu honestamente não sei. Tudo o que sabemos é que o entrelaçamento quântico é real e que você pode aproveitá-lo para fazer maravilhas.</br></br>",
      "Mais uma vez o Gato de Schrödinger pode nos ajudar a entender esse conceito:</br></br><div class='iframe-container'><iframe width='1280' height='720' src='https://www.youtube.com/embed/z1GCnycbMeA' title='YouTube video player' frameborder='0' allow='accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture' allowfullscreen></iframe></div>"
    ]
  },
  {
    "id": 12,
    "path": 2,
    "title": "Exemplo Clássico x Quântico",
    "content": ""
  },

  {
    "id": 13,
    "path": 0,
    "title": "O que esperar futuramente",
    "content": ""
  },
  {
    "id": 14,
    "path": 0,
    "title": "Quer saber mais sobre?",
    "content": ""
  }
]
